БухЭксп/Catalogs/CW_ПоказателиРасчетаРасходаТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПоказателиРасчетаРасходаТоплива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УказываетсяВНастройках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСлужебный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПоказателиРасчетаРасходаТоплива/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьНачальныеНастрокиРеквизитов() экспорт
	
	МакетСтандартнаяНастройка = ПолучитьМакет("СтандартнаяНастройка");

	Для Стр = 2 по МакетСтандартнаяНастройка.ВысотаТаблицы Цикл
		
		ИмяПоказателя 								= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C1").Текст);
		СтрУказываетсяВНастройках 					= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C2").Текст);
		Описание 									= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C3").Текст);
		БуквенныйКод 								= СокрЛП(МакетСтандартнаяНастройка.Область("R"+Формат(Стр,"ЧГ=0")+"C4").Текст);
		
		Попытка
			СпрОбъект = Справочники.CW_ПоказателиРасчетаРасходаТоплива[ИмяПоказателя].ПолучитьОбъект();
			СпрОбъект.УказываетсяВНастройках 				= Вычислить(СтрУказываетсяВНастройках);
			СпрОбъект.Описание 								= Описание;
			СпрОбъект.БуквенныйКод 							= БуквенныйКод;
			
			Идентификатор = ПолучитьИдентификатор(спрОбъект.Наименование);
			
			СпрОбъект.Идентификатор  			= Идентификатор;
			СпрОбъект.ИдентификаторСлужебный  	= Врег(Идентификатор);
			
			СпрОбъект.Записать();
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИдентификатор(СтрНаименование) Экспорт
	
	Идентификатор = "";
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Разделители	=  " .,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";
		
		Идентификатор = "";
		БылСпецСимвол = Ложь;
		Для НомСимвола = 1 По СтрДлина(СтрНаименование) Цикл
			Символ = Сред(СтрНаименование,НомСимвола,1);
			Если Найти(Разделители, Символ) <> 0 Тогда
				БылСпецСимвол = Истина;
			ИначеЕсли БылСпецСимвол Тогда
				БылСпецСимвол = Ложь;
				Идентификатор = Идентификатор + ВРег(Символ);
			Иначе
				Идентификатор = Идентификатор + Символ;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции


Функция ПолучитьМассивПоказателейПолучаемыхИзНастроек() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПоказателиРасчетаРасходаТоплива.Ссылка КАК Показатель
	               |ИЗ
	               |	Справочник.CW_ПоказателиРасчетаРасходаТоплива КАК CW_ПоказателиРасчетаРасходаТоплива
	               |ГДЕ
	               |	И НЕ CW_ПоказателиРасчетаРасходаТоплива.ПометкаУдаления
	               |	CW_ПоказателиРасчетаРасходаТоплива.УказываетсяВНастройках";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Показатель");
	
КонецФункции   
	
Функция ПолучитьМассивПоказателей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ
	              	|	CW_ПоказателиРасчетаРасходаТоплива.Ссылка КАК Показатель
	              	|ИЗ
	              	|	Справочник.CW_ПоказателиРасчетаРасходаТоплива КАК CW_ПоказателиРасчетаРасходаТоплива
	              	|ГДЕ
	              	|	НЕ CW_ПоказателиРасчетаРасходаТоплива.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Показатель");
	
КонецФункции 


Функция ПолучитьСоответствиеПоказателейШапки()  Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ВесПрицепа") 			, "Объект.Прицеп.Модель.Вес");
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ИспользуетсяПрицеп")  , "?(ЗначениеЗаполнено(Объект.Прицеп),1,0)");
	
	Возврат Соответствие;
	                                                                                                        
КонецФункции

Функция ПолучитьСоответствиеПоказателейТабличнойЧасти()  Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ВесГруза")				, "Объект.ЭтапыМаршрута[ИндексСтроки].ВесГруза");
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.КоэффициентТемпературы")	, "Объект.ЭтапыМаршрута[ИндексСтроки].Температура.Коэффициент");
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.КоэффициентУсловий")		, "Объект.ЭтапыМаршрута[ИндексСтроки].УсловияРаботы.Коэффициент");
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.Пробег")					, "Объект.ЭтапыМаршрута[ИндексСтроки].Пробег");
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ПробегСГрузом")			, "Объект.ЭтапыМаршрута[ИндексСтроки].ПробегСГрузом");
	Соответствие.Вставить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ПробегБезПрицепа")		, "Объект.ЭтапыМаршрута[ИндексСтроки].ПробегБезПрицепа");
	
	Возврат Соответствие;
	
КонецФункции

Функция ПоулчитьМассивПоказателейСОсобымПорядком()  Экспорт
	
	МассивПоказателей = Новый Массив;
	МассивПоказателей.Добавить(ПредопределенноеЗначение("Справочник.CW_ПоказателиРасчетаРасходаТоплива.ВремяПростоя"));
	
	Возврат МассивПоказателей;
	
КонецФункции

#КонецЕсли
